weifengdq/embedded/tc364/0_Board_Test_LED/Libraries/Infra/Sfr/TC36x/IfxCpu_reg.h
/** \brief FF04, CPUx Data General Purpose Register 1 */
#define CPU1_D1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF04u)

/** \brief FF08, CPUx Data General Purpose Register 2 */
#define CPU1_D2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF08u)

/** \brief FF0C, CPUx Data General Purpose Register 3 */
#define CPU1_D3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF0Cu)

/** \brief FF10, CPUx Data General Purpose Register 4 */
#define CPU1_D4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF10u)

/** \brief FF14, CPUx Data General Purpose Register 5 */
#define CPU1_D5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF14u)

/** \brief FF18, CPUx Data General Purpose Register 6 */
#define CPU1_D6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF18u)

/** \brief FF1C, CPUx Data General Purpose Register 7 */
#define CPU1_D7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF1Cu)

/** \brief FF20, CPUx Data General Purpose Register 8 */
#define CPU1_D8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF20u)

/** \brief FF24, CPUx Data General Purpose Register 9 */
#define CPU1_D9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF24u)

/** \brief FF28, CPUx Data General Purpose Register 10 */
#define CPU1_D10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF28u)

/** \brief FF2C, CPUx Data General Purpose Register 11 */
#define CPU1_D11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF2Cu)

/** \brief FF30, CPUx Data General Purpose Register 12 */
#define CPU1_D12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF30u)

/** \brief FF34, CPUx Data General Purpose Register 13 */
#define CPU1_D13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF34u)

/** \brief FF38, CPUx Data General Purpose Register 14 */
#define CPU1_D14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF38u)

/** \brief FF3C, CPUx Data General Purpose Register 15 */
#define CPU1_D15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF3Cu)

/** \brief FF80, CPUx Address General Purpose Register 0 */
#define CPU1_A0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FF80u)

/** \brief FF84, CPUx Address General Purpose Register 1 */
#define CPU1_A1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FF84u)

/** \brief FF88, CPUx Address General Purpose Register 2 */
#define CPU1_A2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FF88u)

/** \brief FF8C, CPUx Address General Purpose Register 3 */
#define CPU1_A3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FF8Cu)

/** \brief FF90, CPUx Address General Purpose Register 4 */
#define CPU1_A4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FF90u)

/** \brief FF94, CPUx Address General Purpose Register 5 */
#define CPU1_A5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FF94u)

/** \brief FF98, CPUx Address General Purpose Register 6 */
#define CPU1_A6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FF98u)

/** \brief FF9C, CPUx Address General Purpose Register 7 */
#define CPU1_A7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FF9Cu)

/** \brief FFA0, CPUx Address General Purpose Register 8 */
#define CPU1_A8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FFA0u)

/** \brief FFA4, CPUx Address General Purpose Register 9 */
#define CPU1_A9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FFA4u)

/** \brief FFA8, CPUx Address General Purpose Register 10 */
#define CPU1_A10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FFA8u)

/** \brief FFAC, CPUx Address General Purpose Register 11 */
#define CPU1_A11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FFACu)

/** \brief FFB0, CPUx Address General Purpose Register 12 */
#define CPU1_A12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FFB0u)

/** \brief FFB4, CPUx Address General Purpose Register 13 */
#define CPU1_A13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FFB4u)

/** \brief FFB8, CPUx Address General Purpose Register 14 */
#define CPU1_A14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FFB8u)

/** \brief FFBC, CPUx Address General Purpose Register 15 */
#define CPU1_A15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF883FFBCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXCPU_REG_H */
